"""
The program asks the user for the month and date of birth
and displays the corresponding zodiac sign.

"""
zodiacs = {
    "январь": ("Козерог", 21, "Водолей"),
    "февраль": ("Водолей", 20, "Рыбы"),
    "март": ("Рыбы", 21, "Овен"),
    "апрель": ("Овен", 21, "Телец"),
    "май": ("Телец", 22, "Близнецы"),
    "июнь": ("Близнецы", 22, "Рак"),
    "июль": ("Рак", 23, "Лев"),
    "август": ("Лев", 22, "Дева"),
    "сентябрь": ("Дева", 24, "Весы"),
    "октябрь": ("Весы", 24, "Скорпион"),
    "ноябрь": ("Скорпион", 23, "Стрелец"),
    "декабрь": ("Стрелец", 23, "Козерог")
}

born_day = int(input("Введите день:\n"))
if born_day < 0 or born_day > 31:
    print("Некорректный ввод числа\n")
else:
    month = input("Введите месяц:\n").lower()
    print(f"Ваш знак зодиака: {zodiacs[month][0] if born_day < zodiacs[month][1] else zodiacs[month][2]}")
